/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   pipex.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ayusa <ayusa@student.42tokyo.jp>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/07/05 21:13:01 by ayusa             #+#    #+#             */
/*   Updated: 2025/07/05 21:17:07 by ayusa            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "pipex.h"

void	open_file(char *file)
{
	//中身を扱えるようにする。
}

int	main(int ac, char **av)
{
	open_file(av[1]);
	//↑にav[2]を反映
	//cmd1 の出力をパイプで cmd2 に渡す
	//cmd2 の出力を file2 に書き出す
	return (0);
}
